Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.AnalysisClassEnum
The analysis classes.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.AnalysisClassEnum.ANALYSIS_CLASS_COLUMN
The column analysis class.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.AnalysisClassEnum.ANALYSIS_CLASS_BEAM
The beam analysis class.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.AnalysisClassEnum.ANALYSIS_CLASS_WALL
The wall analysis class.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.AnalysisClassEnum.ANALYSIS_CLASS_SLAB
The slab analysis class.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.AnalysisClassEnum.ANALYSIS_CLASS_CONTOUR_PLATE
The contour plate analysis class.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.AnalysisClassEnum.ANALYSIS_CLASS_SECONDARY
The old secondary object analysis class.
Named now as bracing.
Deprecated since TS2018, ANALYSIS_CLASS_BRACING is used now.
ANALYSIS_CLASS_SECONDARY_MEMBER is used now for actual secondary members.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.AnalysisClassEnum.ANALYSIS_CLASS_BRACING
The bracing object analysis class.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.AnalysisClassEnum.ANALYSIS_CLASS_SECONDARY_MEMBER
The secondary object analysis class.